# Курс на платформе Stepik состоит из нескольких модулей, каждый модуль включает несколько уроков,
# для каждого урока хранится информация о его положении в модуле. Каждый урок состоит из последовательности шагов.
# Каждый шаг имеет свой тип (это может быть текст, задание на SQL и пр.)
# и также порядковый номер в уроке.

# Шаги:
# 1. Подключить базу данные Postgres, развернуть базу, создать окружение, создать движок (sqlalchelmy, asyncpg,  и т.д.;
# 2. Создать модельки алхимии, продумать какие должны быть связи между таблицами;
# 3. Написать код для наполнения базы;
# 4. Написать запросы на получение данных с использование relationship.